**`teams/oasys/webserver`** terragrunt plan on `pull_request` event [#264](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Read complete after 2s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 6s
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/oasys-webserver"
        name         = "oasys_webserver"
      ~ tags         = {
            "application"                  = "OASYS"
            "branch"                       = "main"
            "business-unit"                = "HMPPS"
            "image-pipeline"               = "oasys_webserver"
          ~ "image-recipe"                 = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
          ~ "infrastructure-configuration" = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
            "is-production"                = "true"
            "os-version"                   = "rhel 8.5"
            "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"             = "release"
            "server-type"                  = "oasys-web"
            "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/oasys"
            "update-linux-version"         = "1.0.2"
        }
      ~ tags_all     = {
          ~ "image-recipe"                 = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
          ~ "infrastructure-configuration" = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      - distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/oasys-webserver" -> (known after apply)
      ~ date_created                     = "2023-11-03T12:58:28.284Z" -> (known after apply)
      ~ date_last_run                    = "2023-12-02T00:00:06.924Z" -> (known after apply)
      ~ date_next_run                    = "2024-01-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-11-03T12:58:28.284Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/oasys-webserver" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/oasys-webserver/0.0.11" # forces replacement -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/oasys-webserver-0-0-11" -> (known after apply)
        name                             = "oasys_webserver"
      ~ platform                         = "Linux" -> (known after apply)
      ~ tags                             = {
            "application"                  = "OASYS"
            "branch"                       = "main"
            "business-unit"                = "HMPPS"
            "image-pipeline"               = "oasys_webserver"
          ~ "image-recipe"                 = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
          ~ "infrastructure-configuration" = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
            "is-production"                = "true"
            "os-version"                   = "rhel 8.5"
            "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"             = "release"
            "server-type"                  = "oasys-web"
            "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/oasys"
            "update-linux-version"         = "1.0.2"
        }
      ~ tags_all                         = {
          ~ "image-recipe"                 = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
          ~ "infrastructure-configuration" = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/oasys-webserver/0.0.11" -> (known after apply)
      ~ date_created     = "2023-11-03T12:58:27.397Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/oasys-webserver/0.0.11" -> (known after apply)
        name             = "oasys_webserver"
      ~ owner            = "374269020027" -> (known after apply)
      ~ platform         = "Linux" -> (known after apply)
      ~ tags             = {
            "application"                  = "OASYS"
            "branch"                       = "main"
            "business-unit"                = "HMPPS"
            "image-pipeline"               = "oasys_webserver"
          ~ "image-recipe"                 = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
          ~ "infrastructure-configuration" = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
            "is-production"                = "true"
            "os-version"                   = "rhel 8.5"
            "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"             = "release"
            "server-type"                  = "oasys-web"
            "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/oasys"
            "update-linux-version"         = "1.0.2"
        }
      ~ tags_all         = {
          ~ "image-recipe"                 = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
          ~ "infrastructure-configuration" = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
            # (11 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "0.0.11" -> "0.0.12" # forces replacement
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sda2" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdb" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 128 -> null
              - volume_type           = "gp3" -> null
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdc" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 128 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda2"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdb"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 128
              + volume_type           = "gp3"
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdc"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 128
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/ansible/0.0.5" -> "arn:aws:imagebuilder:eu-west-2:374269020027:component/ansible/0.0.11" # forces replacement

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/oasys-webserver-0-0-11" -> (known after apply)
      ~ date_created                  = "2023-11-03T12:58:27.487Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/oasys-webserver-0-0-11" -> (known after apply)
      ~ name                          = "oasys_webserver_0_0_11" -> "oasys_webserver_0_0_12" # forces replacement
      ~ resource_tags                 = {
          ~ "image-recipe"                 = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
          ~ "infrastructure-configuration" = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
            # (11 unchanged elements hidden)
        }
      ~ tags                          = {
            "application"                  = "OASYS"
            "branch"                       = "main"
            "business-unit"                = "HMPPS"
            "image-pipeline"               = "oasys_webserver"
          ~ "image-recipe"                 = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
          ~ "infrastructure-configuration" = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
            "is-production"                = "true"
            "os-version"                   = "rhel 8.5"
            "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"             = "release"
            "server-type"                  = "oasys-web"
            "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/oasys"
            "update-linux-version"         = "1.0.2"
        }
      ~ tags_all                      = {
          ~ "image-recipe"                 = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
          ~ "infrastructure-configuration" = "oasys_webserver/0.0.11" -> "oasys_webserver/0.0.12"
            # (11 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

```
